foxval/esp-idf/components/soc/esp32c/include/soc/apb_ctrl_reg.h
#define APB_CTRL_FLASH_ACE2_ATTR_REG          (DR_REG_APB_CTRL_BASE + 0x054)
/* APB_CTRL_FLASH_ACE2_ATTR : R/W ;bitpos:[2:0] ;default: 3'h7 ; */
/*description: */
#define APB_CTRL_FLASH_ACE2_ATTR  0x00000007
#define APB_CTRL_FLASH_ACE2_ATTR_M  ((APB_CTRL_FLASH_ACE2_ATTR_V)<<(APB_CTRL_FLASH_ACE2_ATTR_S))
#define APB_CTRL_FLASH_ACE2_ATTR_V  0x7
#define APB_CTRL_FLASH_ACE2_ATTR_S  0

#define APB_CTRL_FLASH_ACE3_ATTR_REG          (DR_REG_APB_CTRL_BASE + 0x058)
/* APB_CTRL_FLASH_ACE3_ATTR : R/W ;bitpos:[2:0] ;default: 3'h7 ; */
/*description: */
#define APB_CTRL_FLASH_ACE3_ATTR  0x00000007
#define APB_CTRL_FLASH_ACE3_ATTR_M  ((APB_CTRL_FLASH_ACE3_ATTR_V)<<(APB_CTRL_FLASH_ACE3_ATTR_S))
#define APB_CTRL_FLASH_ACE3_ATTR_V  0x7
#define APB_CTRL_FLASH_ACE3_ATTR_S  0

#define APB_CTRL_FLASH_ACE4_ATTR_REG          (DR_REG_APB_CTRL_BASE + 0x05C)
/* APB_CTRL_FLASH_ACE4_ATTR : R/W ;bitpos:[2:0] ;default: 3'h7 ; */
/*description: */
#define APB_CTRL_FLASH_ACE4_ATTR  0x00000007
#define APB_CTRL_FLASH_ACE4_ATTR_M  ((APB_CTRL_FLASH_ACE4_ATTR_V)<<(APB_CTRL_FLASH_ACE4_ATTR_S))
#define APB_CTRL_FLASH_ACE4_ATTR_V  0x7
#define APB_CTRL_FLASH_ACE4_ATTR_S  0

#define APB_CTRL_FLASH_ACE5_ATTR_REG          (DR_REG_APB_CTRL_BASE + 0x060)
/* APB_CTRL_FLASH_ACE5_ATTR : R/W ;bitpos:[2:0] ;default: 3'h7 ; */
/*description: */
#define APB_CTRL_FLASH_ACE5_ATTR  0x00000007
#define APB_CTRL_FLASH_ACE5_ATTR_M  ((APB_CTRL_FLASH_ACE5_ATTR_V)<<(APB_CTRL_FLASH_ACE5_ATTR_S))
#define APB_CTRL_FLASH_ACE5_ATTR_V  0x7
#define APB_CTRL_FLASH_ACE5_ATTR_S  0

#define APB_CTRL_FLASH_ACE6_ATTR_REG          (DR_REG_APB_CTRL_BASE + 0x064)
/* APB_CTRL_FLASH_ACE6_ATTR : R/W ;bitpos:[2:0] ;default: 3'h7 ; */
/*description: */
#define APB_CTRL_FLASH_ACE6_ATTR  0x00000007
#define APB_CTRL_FLASH_ACE6_ATTR_M  ((APB_CTRL_FLASH_ACE6_ATTR_V)<<(APB_CTRL_FLASH_ACE6_ATTR_S))
#define APB_CTRL_FLASH_ACE6_ATTR_V  0x7
#define APB_CTRL_FLASH_ACE6_ATTR_S  0

#define APB_CTRL_FLASH_ACE7_ATTR_REG          (DR_REG_APB_CTRL_BASE + 0x068)
/* APB_CTRL_FLASH_ACE7_ATTR : R/W ;bitpos:[2:0] ;default: 3'h7 ; */
/*description: */
#define APB_CTRL_FLASH_ACE7_ATTR  0x00000007
#define APB_CTRL_FLASH_ACE7_ATTR_M  ((APB_CTRL_FLASH_ACE7_ATTR_V)<<(APB_CTRL_FLASH_ACE7_ATTR_S))
#define APB_CTRL_FLASH_ACE7_ATTR_V  0x7
#define APB_CTRL_FLASH_ACE7_ATTR_S  0

#define APB_CTRL_FLASH_ACE0_ADDR_REG          (DR_REG_APB_CTRL_BASE + 0x06C)
/* APB_CTRL_FLASH_ACE0_ADDR_S : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define APB_CTRL_FLASH_ACE0_ADDR_S  0xFFFFFFFF
#define APB_CTRL_FLASH_ACE0_ADDR_S_M  ((APB_CTRL_FLASH_ACE0_ADDR_S_V)<<(APB_CTRL_FLASH_ACE0_ADDR_S_S))
#define APB_CTRL_FLASH_ACE0_ADDR_S_V  0xFFFFFFFF
#define APB_CTRL_FLASH_ACE0_ADDR_S_S  0

#define APB_CTRL_FLASH_ACE1_ADDR_REG          (DR_REG_APB_CTRL_BASE + 0x070)
/* APB_CTRL_FLASH_ACE1_ADDR_S : R/W ;bitpos:[31:0] ;default: 32'h200000 ; */
/*description: */
#define APB_CTRL_FLASH_ACE1_ADDR_S  0xFFFFFFFF
#define APB_CTRL_FLASH_ACE1_ADDR_S_M  ((APB_CTRL_FLASH_ACE1_ADDR_S_V)<<(APB_CTRL_FLASH_ACE1_ADDR_S_S))
#define APB_CTRL_FLASH_ACE1_ADDR_S_V  0xFFFFFFFF
#define APB_CTRL_FLASH_ACE1_ADDR_S_S  0

#define APB_CTRL_FLASH_ACE2_ADDR_REG          (DR_REG_APB_CTRL_BASE + 0x074)
/* APB_CTRL_FLASH_ACE2_ADDR_S : R/W ;bitpos:[31:0] ;default: 32'h400000 ; */
/*description: */
#define APB_CTRL_FLASH_ACE2_ADDR_S  0xFFFFFFFF
#define APB_CTRL_FLASH_ACE2_ADDR_S_M  ((APB_CTRL_FLASH_ACE2_ADDR_S_V)<<(APB_CTRL_FLASH_ACE2_ADDR_S_S))
#define APB_CTRL_FLASH_ACE2_ADDR_S_V  0xFFFFFFFF
#define APB_CTRL_FLASH_ACE2_ADDR_S_S  0

#define APB_CTRL_FLASH_ACE3_ADDR_REG          (DR_REG_APB_CTRL_BASE + 0x078)
/* APB_CTRL_FLASH_ACE3_ADDR_S : R/W ;bitpos:[31:0] ;default: 32'h600000 ; */
/*description: */
#define APB_CTRL_FLASH_ACE3_ADDR_S  0xFFFFFFFF
#define APB_CTRL_FLASH_ACE3_ADDR_S_M  ((APB_CTRL_FLASH_ACE3_ADDR_S_V)<<(APB_CTRL_FLASH_ACE3_ADDR_S_S))
#define APB_CTRL_FLASH_ACE3_ADDR_S_V  0xFFFFFFFF
#define APB_CTRL_FLASH_ACE3_ADDR_S_S  0

#define APB_CTRL_FLASH_ACE4_ADDR_REG          (DR_REG_APB_CTRL_BASE + 0x07C)
/* APB_CTRL_FLASH_ACE4_ADDR_S : R/W ;bitpos:[31:0] ;default: 32'h800000 ; */
/*description: */
#define APB_CTRL_FLASH_ACE4_ADDR_S  0xFFFFFFFF
#define APB_CTRL_FLASH_ACE4_ADDR_S_M  ((APB_CTRL_FLASH_ACE4_ADDR_S_V)<<(APB_CTRL_FLASH_ACE4_ADDR_S_S))
#define APB_CTRL_FLASH_ACE4_ADDR_S_V  0xFFFFFFFF
#define APB_CTRL_FLASH_ACE4_ADDR_S_S  0

#define APB_CTRL_FLASH_ACE5_ADDR_REG          (DR_REG_APB_CTRL_BASE + 0x080)
/* APB_CTRL_FLASH_ACE5_ADDR_S : R/W ;bitpos:[31:0] ;default: 32'hA00000 ; */
/*description: */
#define APB_CTRL_FLASH_ACE5_ADDR_S  0xFFFFFFFF
#define APB_CTRL_FLASH_ACE5_ADDR_S_M  ((APB_CTRL_FLASH_ACE5_ADDR_S_V)<<(APB_CTRL_FLASH_ACE5_ADDR_S_S))
#define APB_CTRL_FLASH_ACE5_ADDR_S_V  0xFFFFFFFF
#define APB_CTRL_FLASH_ACE5_ADDR_S_S  0

#define APB_CTRL_FLASH_ACE6_ADDR_REG          (DR_REG_APB_CTRL_BASE + 0x084)
/* APB_CTRL_FLASH_ACE6_ADDR_S : R/W ;bitpos:[31:0] ;default: 32'hC00000 ; */
/*description: */
#define APB_CTRL_FLASH_ACE6_ADDR_S  0xFFFFFFFF
#define APB_CTRL_FLASH_ACE6_ADDR_S_M  ((APB_CTRL_FLASH_ACE6_ADDR_S_V)<<(APB_CTRL_FLASH_ACE6_ADDR_S_S))
#define APB_CTRL_FLASH_ACE6_ADDR_S_V  0xFFFFFFFF
#define APB_CTRL_FLASH_ACE6_ADDR_S_S  0

#define APB_CTRL_FLASH_ACE7_ADDR_REG          (DR_REG_APB_CTRL_BASE + 0x088)
/* APB_CTRL_FLASH_ACE7_ADDR_S : R/W ;bitpos:[31:0] ;default: 32'hE00000 ; */
/*description: */
#define APB_CTRL_FLASH_ACE7_ADDR_S  0xFFFFFFFF
#define APB_CTRL_FLASH_ACE7_ADDR_S_M  ((APB_CTRL_FLASH_ACE7_ADDR_S_V)<<(APB_CTRL_FLASH_ACE7_ADDR_S_S))
#define APB_CTRL_FLASH_ACE7_ADDR_S_V  0xFFFFFFFF
#define APB_CTRL_FLASH_ACE7_ADDR_S_S  0

#define APB_CTRL_FLASH_ACE0_SIZE_REG          (DR_REG_APB_CTRL_BASE + 0x08C)
/* APB_CTRL_FLASH_ACE0_SIZE : R/W ;bitpos:[15:0] ;default: 16'h20 ; */
/*description: */
#define APB_CTRL_FLASH_ACE0_SIZE  0x0000FFFF
#define APB_CTRL_FLASH_ACE0_SIZE_M  ((APB_CTRL_FLASH_ACE0_SIZE_V)<<(APB_CTRL_FLASH_ACE0_SIZE_S))
#define APB_CTRL_FLASH_ACE0_SIZE_V  0xFFFF
#define APB_CTRL_FLASH_ACE0_SIZE_S  0

#define APB_CTRL_FLASH_ACE1_SIZE_REG          (DR_REG_APB_CTRL_BASE + 0x090)
/* APB_CTRL_FLASH_ACE1_SIZE : R/W ;bitpos:[15:0] ;default: 16'h20 ; */
/*description: */
#define APB_CTRL_FLASH_ACE1_SIZE  0x0000FFFF
#define APB_CTRL_FLASH_ACE1_SIZE_M  ((APB_CTRL_FLASH_ACE1_SIZE_V)<<(APB_CTRL_FLASH_ACE1_SIZE_S))
#define APB_CTRL_FLASH_ACE1_SIZE_V  0xFFFF
#define APB_CTRL_FLASH_ACE1_SIZE_S  0

