foxval/esp-idf/components/soc/esp32c/include/soc/apb_ctrl_reg.h
#define APB_CTRL_FLASH_ACE2_SIZE_REG          (DR_REG_APB_CTRL_BASE + 0x094)
/* APB_CTRL_FLASH_ACE2_SIZE : R/W ;bitpos:[15:0] ;default: 16'h20 ; */
/*description: */
#define APB_CTRL_FLASH_ACE2_SIZE  0x0000FFFF
#define APB_CTRL_FLASH_ACE2_SIZE_M  ((APB_CTRL_FLASH_ACE2_SIZE_V)<<(APB_CTRL_FLASH_ACE2_SIZE_S))
#define APB_CTRL_FLASH_ACE2_SIZE_V  0xFFFF
#define APB_CTRL_FLASH_ACE2_SIZE_S  0

#define APB_CTRL_FLASH_ACE3_SIZE_REG          (DR_REG_APB_CTRL_BASE + 0x098)
/* APB_CTRL_FLASH_ACE3_SIZE : R/W ;bitpos:[15:0] ;default: 16'h20 ; */
/*description: */
#define APB_CTRL_FLASH_ACE3_SIZE  0x0000FFFF
#define APB_CTRL_FLASH_ACE3_SIZE_M  ((APB_CTRL_FLASH_ACE3_SIZE_V)<<(APB_CTRL_FLASH_ACE3_SIZE_S))
#define APB_CTRL_FLASH_ACE3_SIZE_V  0xFFFF
#define APB_CTRL_FLASH_ACE3_SIZE_S  0

#define APB_CTRL_FLASH_ACE4_SIZE_REG          (DR_REG_APB_CTRL_BASE + 0x09C)
/* APB_CTRL_FLASH_ACE4_SIZE : R/W ;bitpos:[15:0] ;default: 16'h20 ; */
/*description: */
#define APB_CTRL_FLASH_ACE4_SIZE  0x0000FFFF
#define APB_CTRL_FLASH_ACE4_SIZE_M  ((APB_CTRL_FLASH_ACE4_SIZE_V)<<(APB_CTRL_FLASH_ACE4_SIZE_S))
#define APB_CTRL_FLASH_ACE4_SIZE_V  0xFFFF
#define APB_CTRL_FLASH_ACE4_SIZE_S  0

#define APB_CTRL_FLASH_ACE5_SIZE_REG          (DR_REG_APB_CTRL_BASE + 0x0A0)
/* APB_CTRL_FLASH_ACE5_SIZE : R/W ;bitpos:[15:0] ;default: 16'h20 ; */
/*description: */
#define APB_CTRL_FLASH_ACE5_SIZE  0x0000FFFF
#define APB_CTRL_FLASH_ACE5_SIZE_M  ((APB_CTRL_FLASH_ACE5_SIZE_V)<<(APB_CTRL_FLASH_ACE5_SIZE_S))
#define APB_CTRL_FLASH_ACE5_SIZE_V  0xFFFF
#define APB_CTRL_FLASH_ACE5_SIZE_S  0

#define APB_CTRL_FLASH_ACE6_SIZE_REG          (DR_REG_APB_CTRL_BASE + 0x0A4)
/* APB_CTRL_FLASH_ACE6_SIZE : R/W ;bitpos:[15:0] ;default: 16'h20 ; */
/*description: */
#define APB_CTRL_FLASH_ACE6_SIZE  0x0000FFFF
#define APB_CTRL_FLASH_ACE6_SIZE_M  ((APB_CTRL_FLASH_ACE6_SIZE_V)<<(APB_CTRL_FLASH_ACE6_SIZE_S))
#define APB_CTRL_FLASH_ACE6_SIZE_V  0xFFFF
#define APB_CTRL_FLASH_ACE6_SIZE_S  0

#define APB_CTRL_FLASH_ACE7_SIZE_REG          (DR_REG_APB_CTRL_BASE + 0x0A8)
/* APB_CTRL_FLASH_ACE7_SIZE : R/W ;bitpos:[15:0] ;default: 16'h20 ; */
/*description: */
#define APB_CTRL_FLASH_ACE7_SIZE  0x0000FFFF
#define APB_CTRL_FLASH_ACE7_SIZE_M  ((APB_CTRL_FLASH_ACE7_SIZE_V)<<(APB_CTRL_FLASH_ACE7_SIZE_S))
#define APB_CTRL_FLASH_ACE7_SIZE_V  0xFFFF
#define APB_CTRL_FLASH_ACE7_SIZE_S  0

#define APB_CTRL_SRAM_ACE0_ATTR_REG          (DR_REG_APB_CTRL_BASE + 0x0AC)
/* APB_CTRL_SRAM_ACE0_ATTR : R/W ;bitpos:[2:0] ;default: 3'h7 ; */
/*description: */
#define APB_CTRL_SRAM_ACE0_ATTR  0x00000007
#define APB_CTRL_SRAM_ACE0_ATTR_M  ((APB_CTRL_SRAM_ACE0_ATTR_V)<<(APB_CTRL_SRAM_ACE0_ATTR_S))
#define APB_CTRL_SRAM_ACE0_ATTR_V  0x7
#define APB_CTRL_SRAM_ACE0_ATTR_S  0

#define APB_CTRL_SRAM_ACE1_ATTR_REG          (DR_REG_APB_CTRL_BASE + 0x0B0)
/* APB_CTRL_SRAM_ACE1_ATTR : R/W ;bitpos:[2:0] ;default: 3'h7 ; */
/*description: */
#define APB_CTRL_SRAM_ACE1_ATTR  0x00000007
#define APB_CTRL_SRAM_ACE1_ATTR_M  ((APB_CTRL_SRAM_ACE1_ATTR_V)<<(APB_CTRL_SRAM_ACE1_ATTR_S))
#define APB_CTRL_SRAM_ACE1_ATTR_V  0x7
#define APB_CTRL_SRAM_ACE1_ATTR_S  0

#define APB_CTRL_SRAM_ACE2_ATTR_REG          (DR_REG_APB_CTRL_BASE + 0x0B4)
/* APB_CTRL_SRAM_ACE2_ATTR : R/W ;bitpos:[2:0] ;default: 3'h7 ; */
/*description: */
#define APB_CTRL_SRAM_ACE2_ATTR  0x00000007
#define APB_CTRL_SRAM_ACE2_ATTR_M  ((APB_CTRL_SRAM_ACE2_ATTR_V)<<(APB_CTRL_SRAM_ACE2_ATTR_S))
#define APB_CTRL_SRAM_ACE2_ATTR_V  0x7
#define APB_CTRL_SRAM_ACE2_ATTR_S  0

#define APB_CTRL_SRAM_ACE3_ATTR_REG          (DR_REG_APB_CTRL_BASE + 0x0B8)
/* APB_CTRL_SRAM_ACE3_ATTR : R/W ;bitpos:[2:0] ;default: 3'h7 ; */
/*description: */
#define APB_CTRL_SRAM_ACE3_ATTR  0x00000007
#define APB_CTRL_SRAM_ACE3_ATTR_M  ((APB_CTRL_SRAM_ACE3_ATTR_V)<<(APB_CTRL_SRAM_ACE3_ATTR_S))
#define APB_CTRL_SRAM_ACE3_ATTR_V  0x7
#define APB_CTRL_SRAM_ACE3_ATTR_S  0

#define APB_CTRL_SRAM_ACE4_ATTR_REG          (DR_REG_APB_CTRL_BASE + 0x0BC)
/* APB_CTRL_SRAM_ACE4_ATTR : R/W ;bitpos:[2:0] ;default: 3'h7 ; */
/*description: */
#define APB_CTRL_SRAM_ACE4_ATTR  0x00000007
#define APB_CTRL_SRAM_ACE4_ATTR_M  ((APB_CTRL_SRAM_ACE4_ATTR_V)<<(APB_CTRL_SRAM_ACE4_ATTR_S))
#define APB_CTRL_SRAM_ACE4_ATTR_V  0x7
#define APB_CTRL_SRAM_ACE4_ATTR_S  0

#define APB_CTRL_SRAM_ACE5_ATTR_REG          (DR_REG_APB_CTRL_BASE + 0x0C0)
/* APB_CTRL_SRAM_ACE5_ATTR : R/W ;bitpos:[2:0] ;default: 3'h7 ; */
/*description: */
#define APB_CTRL_SRAM_ACE5_ATTR  0x00000007
#define APB_CTRL_SRAM_ACE5_ATTR_M  ((APB_CTRL_SRAM_ACE5_ATTR_V)<<(APB_CTRL_SRAM_ACE5_ATTR_S))
#define APB_CTRL_SRAM_ACE5_ATTR_V  0x7
#define APB_CTRL_SRAM_ACE5_ATTR_S  0

#define APB_CTRL_SRAM_ACE6_ATTR_REG          (DR_REG_APB_CTRL_BASE + 0x0C4)
/* APB_CTRL_SRAM_ACE6_ATTR : R/W ;bitpos:[2:0] ;default: 3'h7 ; */
/*description: */
#define APB_CTRL_SRAM_ACE6_ATTR  0x00000007
#define APB_CTRL_SRAM_ACE6_ATTR_M  ((APB_CTRL_SRAM_ACE6_ATTR_V)<<(APB_CTRL_SRAM_ACE6_ATTR_S))
#define APB_CTRL_SRAM_ACE6_ATTR_V  0x7
#define APB_CTRL_SRAM_ACE6_ATTR_S  0

#define APB_CTRL_SRAM_ACE7_ATTR_REG          (DR_REG_APB_CTRL_BASE + 0x0C8)
/* APB_CTRL_SRAM_ACE7_ATTR : R/W ;bitpos:[2:0] ;default: 3'h7 ; */
/*description: */
#define APB_CTRL_SRAM_ACE7_ATTR  0x00000007
#define APB_CTRL_SRAM_ACE7_ATTR_M  ((APB_CTRL_SRAM_ACE7_ATTR_V)<<(APB_CTRL_SRAM_ACE7_ATTR_S))
#define APB_CTRL_SRAM_ACE7_ATTR_V  0x7
#define APB_CTRL_SRAM_ACE7_ATTR_S  0

#define APB_CTRL_SRAM_ACE0_ADDR_REG          (DR_REG_APB_CTRL_BASE + 0x0CC)
/* APB_CTRL_SRAM_ACE0_ADDR_S : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define APB_CTRL_SRAM_ACE0_ADDR_S  0xFFFFFFFF
#define APB_CTRL_SRAM_ACE0_ADDR_S_M  ((APB_CTRL_SRAM_ACE0_ADDR_S_V)<<(APB_CTRL_SRAM_ACE0_ADDR_S_S))
#define APB_CTRL_SRAM_ACE0_ADDR_S_V  0xFFFFFFFF
#define APB_CTRL_SRAM_ACE0_ADDR_S_S  0

#define APB_CTRL_SRAM_ACE1_ADDR_REG          (DR_REG_APB_CTRL_BASE + 0x0D0)
/* APB_CTRL_SRAM_ACE1_ADDR_S : R/W ;bitpos:[31:0] ;default: 32'h200000 ; */
/*description: */
#define APB_CTRL_SRAM_ACE1_ADDR_S  0xFFFFFFFF
#define APB_CTRL_SRAM_ACE1_ADDR_S_M  ((APB_CTRL_SRAM_ACE1_ADDR_S_V)<<(APB_CTRL_SRAM_ACE1_ADDR_S_S))
#define APB_CTRL_SRAM_ACE1_ADDR_S_V  0xFFFFFFFF
#define APB_CTRL_SRAM_ACE1_ADDR_S_S  0

