foxval/esp-idf/components/soc/esp32c/include/soc/apb_ctrl_reg.h
#define APB_CTRL_SRAM_ACE2_ADDR_REG          (DR_REG_APB_CTRL_BASE + 0x0D4)
/* APB_CTRL_SRAM_ACE2_ADDR_S : R/W ;bitpos:[31:0] ;default: 32'h400000 ; */
/*description: */
#define APB_CTRL_SRAM_ACE2_ADDR_S  0xFFFFFFFF
#define APB_CTRL_SRAM_ACE2_ADDR_S_M  ((APB_CTRL_SRAM_ACE2_ADDR_S_V)<<(APB_CTRL_SRAM_ACE2_ADDR_S_S))
#define APB_CTRL_SRAM_ACE2_ADDR_S_V  0xFFFFFFFF
#define APB_CTRL_SRAM_ACE2_ADDR_S_S  0

#define APB_CTRL_SRAM_ACE3_ADDR_REG          (DR_REG_APB_CTRL_BASE + 0x0D8)
/* APB_CTRL_SRAM_ACE3_ADDR_S : R/W ;bitpos:[31:0] ;default: 32'h600000 ; */
/*description: */
#define APB_CTRL_SRAM_ACE3_ADDR_S  0xFFFFFFFF
#define APB_CTRL_SRAM_ACE3_ADDR_S_M  ((APB_CTRL_SRAM_ACE3_ADDR_S_V)<<(APB_CTRL_SRAM_ACE3_ADDR_S_S))
#define APB_CTRL_SRAM_ACE3_ADDR_S_V  0xFFFFFFFF
#define APB_CTRL_SRAM_ACE3_ADDR_S_S  0

#define APB_CTRL_SRAM_ACE4_ADDR_REG          (DR_REG_APB_CTRL_BASE + 0x0DC)
/* APB_CTRL_SRAM_ACE4_ADDR_S : R/W ;bitpos:[31:0] ;default: 32'h800000 ; */
/*description: */
#define APB_CTRL_SRAM_ACE4_ADDR_S  0xFFFFFFFF
#define APB_CTRL_SRAM_ACE4_ADDR_S_M  ((APB_CTRL_SRAM_ACE4_ADDR_S_V)<<(APB_CTRL_SRAM_ACE4_ADDR_S_S))
#define APB_CTRL_SRAM_ACE4_ADDR_S_V  0xFFFFFFFF
#define APB_CTRL_SRAM_ACE4_ADDR_S_S  0

#define APB_CTRL_SRAM_ACE5_ADDR_REG          (DR_REG_APB_CTRL_BASE + 0x0E0)
/* APB_CTRL_SRAM_ACE5_ADDR_S : R/W ;bitpos:[31:0] ;default: 32'hA00000 ; */
/*description: */
#define APB_CTRL_SRAM_ACE5_ADDR_S  0xFFFFFFFF
#define APB_CTRL_SRAM_ACE5_ADDR_S_M  ((APB_CTRL_SRAM_ACE5_ADDR_S_V)<<(APB_CTRL_SRAM_ACE5_ADDR_S_S))
#define APB_CTRL_SRAM_ACE5_ADDR_S_V  0xFFFFFFFF
#define APB_CTRL_SRAM_ACE5_ADDR_S_S  0

#define APB_CTRL_SRAM_ACE6_ADDR_REG          (DR_REG_APB_CTRL_BASE + 0x0E4)
/* APB_CTRL_SRAM_ACE6_ADDR_S : R/W ;bitpos:[31:0] ;default: 32'hC00000 ; */
/*description: */
#define APB_CTRL_SRAM_ACE6_ADDR_S  0xFFFFFFFF
#define APB_CTRL_SRAM_ACE6_ADDR_S_M  ((APB_CTRL_SRAM_ACE6_ADDR_S_V)<<(APB_CTRL_SRAM_ACE6_ADDR_S_S))
#define APB_CTRL_SRAM_ACE6_ADDR_S_V  0xFFFFFFFF
#define APB_CTRL_SRAM_ACE6_ADDR_S_S  0

#define APB_CTRL_SRAM_ACE7_ADDR_REG          (DR_REG_APB_CTRL_BASE + 0x0E8)
/* APB_CTRL_SRAM_ACE7_ADDR_S : R/W ;bitpos:[31:0] ;default: 32'hE00000 ; */
/*description: */
#define APB_CTRL_SRAM_ACE7_ADDR_S  0xFFFFFFFF
#define APB_CTRL_SRAM_ACE7_ADDR_S_M  ((APB_CTRL_SRAM_ACE7_ADDR_S_V)<<(APB_CTRL_SRAM_ACE7_ADDR_S_S))
#define APB_CTRL_SRAM_ACE7_ADDR_S_V  0xFFFFFFFF
#define APB_CTRL_SRAM_ACE7_ADDR_S_S  0

#define APB_CTRL_SRAM_ACE0_SIZE_REG          (DR_REG_APB_CTRL_BASE + 0x0EC)
/* APB_CTRL_SRAM_ACE0_SIZE : R/W ;bitpos:[15:0] ;default: 16'h20 ; */
/*description: */
#define APB_CTRL_SRAM_ACE0_SIZE  0x0000FFFF
#define APB_CTRL_SRAM_ACE0_SIZE_M  ((APB_CTRL_SRAM_ACE0_SIZE_V)<<(APB_CTRL_SRAM_ACE0_SIZE_S))
#define APB_CTRL_SRAM_ACE0_SIZE_V  0xFFFF
#define APB_CTRL_SRAM_ACE0_SIZE_S  0

#define APB_CTRL_SRAM_ACE1_SIZE_REG          (DR_REG_APB_CTRL_BASE + 0x0F0)
/* APB_CTRL_SRAM_ACE1_SIZE : R/W ;bitpos:[15:0] ;default: 16'h20 ; */
/*description: */
#define APB_CTRL_SRAM_ACE1_SIZE  0x0000FFFF
#define APB_CTRL_SRAM_ACE1_SIZE_M  ((APB_CTRL_SRAM_ACE1_SIZE_V)<<(APB_CTRL_SRAM_ACE1_SIZE_S))
#define APB_CTRL_SRAM_ACE1_SIZE_V  0xFFFF
#define APB_CTRL_SRAM_ACE1_SIZE_S  0

#define APB_CTRL_SRAM_ACE2_SIZE_REG          (DR_REG_APB_CTRL_BASE + 0x0F4)
/* APB_CTRL_SRAM_ACE2_SIZE : R/W ;bitpos:[15:0] ;default: 16'h20 ; */
/*description: */
#define APB_CTRL_SRAM_ACE2_SIZE  0x0000FFFF
#define APB_CTRL_SRAM_ACE2_SIZE_M  ((APB_CTRL_SRAM_ACE2_SIZE_V)<<(APB_CTRL_SRAM_ACE2_SIZE_S))
#define APB_CTRL_SRAM_ACE2_SIZE_V  0xFFFF
#define APB_CTRL_SRAM_ACE2_SIZE_S  0

#define APB_CTRL_SRAM_ACE3_SIZE_REG          (DR_REG_APB_CTRL_BASE + 0x0F8)
/* APB_CTRL_SRAM_ACE3_SIZE : R/W ;bitpos:[15:0] ;default: 16'h20 ; */
/*description: */
#define APB_CTRL_SRAM_ACE3_SIZE  0x0000FFFF
#define APB_CTRL_SRAM_ACE3_SIZE_M  ((APB_CTRL_SRAM_ACE3_SIZE_V)<<(APB_CTRL_SRAM_ACE3_SIZE_S))
#define APB_CTRL_SRAM_ACE3_SIZE_V  0xFFFF
#define APB_CTRL_SRAM_ACE3_SIZE_S  0

#define APB_CTRL_SRAM_ACE4_SIZE_REG          (DR_REG_APB_CTRL_BASE + 0x0FC)
/* APB_CTRL_SRAM_ACE4_SIZE : R/W ;bitpos:[15:0] ;default: 16'h20 ; */
/*description: */
#define APB_CTRL_SRAM_ACE4_SIZE  0x0000FFFF
#define APB_CTRL_SRAM_ACE4_SIZE_M  ((APB_CTRL_SRAM_ACE4_SIZE_V)<<(APB_CTRL_SRAM_ACE4_SIZE_S))
#define APB_CTRL_SRAM_ACE4_SIZE_V  0xFFFF
#define APB_CTRL_SRAM_ACE4_SIZE_S  0

#define APB_CTRL_SRAM_ACE5_SIZE_REG          (DR_REG_APB_CTRL_BASE + 0x100)
/* APB_CTRL_SRAM_ACE5_SIZE : R/W ;bitpos:[15:0] ;default: 16'h20 ; */
/*description: */
#define APB_CTRL_SRAM_ACE5_SIZE  0x0000FFFF
#define APB_CTRL_SRAM_ACE5_SIZE_M  ((APB_CTRL_SRAM_ACE5_SIZE_V)<<(APB_CTRL_SRAM_ACE5_SIZE_S))
#define APB_CTRL_SRAM_ACE5_SIZE_V  0xFFFF
#define APB_CTRL_SRAM_ACE5_SIZE_S  0

#define APB_CTRL_SRAM_ACE6_SIZE_REG          (DR_REG_APB_CTRL_BASE + 0x104)
/* APB_CTRL_SRAM_ACE6_SIZE : R/W ;bitpos:[15:0] ;default: 16'h20 ; */
/*description: */
#define APB_CTRL_SRAM_ACE6_SIZE  0x0000FFFF
#define APB_CTRL_SRAM_ACE6_SIZE_M  ((APB_CTRL_SRAM_ACE6_SIZE_V)<<(APB_CTRL_SRAM_ACE6_SIZE_S))
#define APB_CTRL_SRAM_ACE6_SIZE_V  0xFFFF
#define APB_CTRL_SRAM_ACE6_SIZE_S  0

#define APB_CTRL_SRAM_ACE7_SIZE_REG          (DR_REG_APB_CTRL_BASE + 0x108)
/* APB_CTRL_SRAM_ACE7_SIZE : R/W ;bitpos:[15:0] ;default: 16'h20 ; */
/*description: */
#define APB_CTRL_SRAM_ACE7_SIZE  0x0000FFFF
#define APB_CTRL_SRAM_ACE7_SIZE_M  ((APB_CTRL_SRAM_ACE7_SIZE_V)<<(APB_CTRL_SRAM_ACE7_SIZE_S))
#define APB_CTRL_SRAM_ACE7_SIZE_V  0xFFFF
#define APB_CTRL_SRAM_ACE7_SIZE_S  0

#define APB_CTRL_G0SPI0_PMS_CTRL_REG          (DR_REG_APB_CTRL_BASE + 0x10C)
/* APB_CTRL_G0SPI0_REJECT_CDE : RO ;bitpos:[6:2] ;default: 5'h0 ; */
/*description: */
#define APB_CTRL_G0SPI0_REJECT_CDE  0x0000001F
#define APB_CTRL_G0SPI0_REJECT_CDE_M  ((APB_CTRL_G0SPI0_REJECT_CDE_V)<<(APB_CTRL_G0SPI0_REJECT_CDE_S))
#define APB_CTRL_G0SPI0_REJECT_CDE_V  0x1F
#define APB_CTRL_G0SPI0_REJECT_CDE_S  2
/* APB_CTRL_G0SPI0_REJECT_CLR : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define APB_CTRL_G0SPI0_REJECT_CLR  (BIT(1))
#define APB_CTRL_G0SPI0_REJECT_CLR_M  (BIT(1))
#define APB_CTRL_G0SPI0_REJECT_CLR_V  0x1
#define APB_CTRL_G0SPI0_REJECT_CLR_S  1
/* APB_CTRL_G0SPI0_REJECT_INT : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define APB_CTRL_G0SPI0_REJECT_INT  (BIT(0))
#define APB_CTRL_G0SPI0_REJECT_INT_M  (BIT(0))
#define APB_CTRL_G0SPI0_REJECT_INT_V  0x1
#define APB_CTRL_G0SPI0_REJECT_INT_S  0

#define APB_CTRL_G0SPI0_REJECT_ADDR_REG          (DR_REG_APB_CTRL_BASE + 0x110)
/* APB_CTRL_G0SPI0_REJECT_ADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define APB_CTRL_G0SPI0_REJECT_ADDR  0xFFFFFFFF
#define APB_CTRL_G0SPI0_REJECT_ADDR_M  ((APB_CTRL_G0SPI0_REJECT_ADDR_V)<<(APB_CTRL_G0SPI0_REJECT_ADDR_S))
#define APB_CTRL_G0SPI0_REJECT_ADDR_V  0xFFFFFFFF
#define APB_CTRL_G0SPI0_REJECT_ADDR_S  0

