foxval/esp-idf/components/soc/esp32c/include/soc/apb_ctrl_reg.h
#define APB_CTRL_G0SPI1_PMS_CTRL_REG          (DR_REG_APB_CTRL_BASE + 0x114)
/* APB_CTRL_G0SPI1_REJECT_CDE : RO ;bitpos:[6:2] ;default: 5'h0 ; */
/*description: */
#define APB_CTRL_G0SPI1_REJECT_CDE  0x0000001F
#define APB_CTRL_G0SPI1_REJECT_CDE_M  ((APB_CTRL_G0SPI1_REJECT_CDE_V)<<(APB_CTRL_G0SPI1_REJECT_CDE_S))
#define APB_CTRL_G0SPI1_REJECT_CDE_V  0x1F
#define APB_CTRL_G0SPI1_REJECT_CDE_S  2
/* APB_CTRL_G0SPI1_REJECT_CLR : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define APB_CTRL_G0SPI1_REJECT_CLR  (BIT(1))
#define APB_CTRL_G0SPI1_REJECT_CLR_M  (BIT(1))
#define APB_CTRL_G0SPI1_REJECT_CLR_V  0x1
#define APB_CTRL_G0SPI1_REJECT_CLR_S  1
/* APB_CTRL_G0SPI1_REJECT_INT : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define APB_CTRL_G0SPI1_REJECT_INT  (BIT(0))
#define APB_CTRL_G0SPI1_REJECT_INT_M  (BIT(0))
#define APB_CTRL_G0SPI1_REJECT_INT_V  0x1
#define APB_CTRL_G0SPI1_REJECT_INT_S  0

#define APB_CTRL_G0SPI1_REJECT_ADDR_REG          (DR_REG_APB_CTRL_BASE + 0x118)
/* APB_CTRL_G0SPI1_REJECT_ADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define APB_CTRL_G0SPI1_REJECT_ADDR  0xFFFFFFFF
#define APB_CTRL_G0SPI1_REJECT_ADDR_M  ((APB_CTRL_G0SPI1_REJECT_ADDR_V)<<(APB_CTRL_G0SPI1_REJECT_ADDR_S))
#define APB_CTRL_G0SPI1_REJECT_ADDR_V  0xFFFFFFFF
#define APB_CTRL_G0SPI1_REJECT_ADDR_S  0

#define APB_CTRL_G1SPI0_PMS_CTRL_REG          (DR_REG_APB_CTRL_BASE + 0x11C)
/* APB_CTRL_G1SPI0_REJECT_CDE : RO ;bitpos:[6:2] ;default: 5'h0 ; */
/*description: */
#define APB_CTRL_G1SPI0_REJECT_CDE  0x0000001F
#define APB_CTRL_G1SPI0_REJECT_CDE_M  ((APB_CTRL_G1SPI0_REJECT_CDE_V)<<(APB_CTRL_G1SPI0_REJECT_CDE_S))
#define APB_CTRL_G1SPI0_REJECT_CDE_V  0x1F
#define APB_CTRL_G1SPI0_REJECT_CDE_S  2
/* APB_CTRL_G1SPI0_REJECT_CLR : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define APB_CTRL_G1SPI0_REJECT_CLR  (BIT(1))
#define APB_CTRL_G1SPI0_REJECT_CLR_M  (BIT(1))
#define APB_CTRL_G1SPI0_REJECT_CLR_V  0x1
#define APB_CTRL_G1SPI0_REJECT_CLR_S  1
/* APB_CTRL_G1SPI0_REJECT_INT : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define APB_CTRL_G1SPI0_REJECT_INT  (BIT(0))
#define APB_CTRL_G1SPI0_REJECT_INT_M  (BIT(0))
#define APB_CTRL_G1SPI0_REJECT_INT_V  0x1
#define APB_CTRL_G1SPI0_REJECT_INT_S  0

#define APB_CTRL_G1SPI0_REJECT_ADDR_REG          (DR_REG_APB_CTRL_BASE + 0x120)
/* APB_CTRL_G1SPI0_REJECT_ADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define APB_CTRL_G1SPI0_REJECT_ADDR  0xFFFFFFFF
#define APB_CTRL_G1SPI0_REJECT_ADDR_M  ((APB_CTRL_G1SPI0_REJECT_ADDR_V)<<(APB_CTRL_G1SPI0_REJECT_ADDR_S))
#define APB_CTRL_G1SPI0_REJECT_ADDR_V  0xFFFFFFFF
#define APB_CTRL_G1SPI0_REJECT_ADDR_S  0

#define APB_CTRL_G1SPI1_PMS_CTRL_REG          (DR_REG_APB_CTRL_BASE + 0x124)
/* APB_CTRL_G1SPI1_REJECT_CDE : RO ;bitpos:[6:2] ;default: 5'h0 ; */
/*description: */
#define APB_CTRL_G1SPI1_REJECT_CDE  0x0000001F
#define APB_CTRL_G1SPI1_REJECT_CDE_M  ((APB_CTRL_G1SPI1_REJECT_CDE_V)<<(APB_CTRL_G1SPI1_REJECT_CDE_S))
#define APB_CTRL_G1SPI1_REJECT_CDE_V  0x1F
#define APB_CTRL_G1SPI1_REJECT_CDE_S  2
/* APB_CTRL_G1SPI1_REJECT_CLR : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define APB_CTRL_G1SPI1_REJECT_CLR  (BIT(1))
#define APB_CTRL_G1SPI1_REJECT_CLR_M  (BIT(1))
#define APB_CTRL_G1SPI1_REJECT_CLR_V  0x1
#define APB_CTRL_G1SPI1_REJECT_CLR_S  1
/* APB_CTRL_G1SPI1_REJECT_INT : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define APB_CTRL_G1SPI1_REJECT_INT  (BIT(0))
#define APB_CTRL_G1SPI1_REJECT_INT_M  (BIT(0))
#define APB_CTRL_G1SPI1_REJECT_INT_V  0x1
#define APB_CTRL_G1SPI1_REJECT_INT_S  0

#define APB_CTRL_G1SPI1_REJECT_ADDR_REG          (DR_REG_APB_CTRL_BASE + 0x128)
/* APB_CTRL_G1SPI1_REJECT_ADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define APB_CTRL_G1SPI1_REJECT_ADDR  0xFFFFFFFF
#define APB_CTRL_G1SPI1_REJECT_ADDR_M  ((APB_CTRL_G1SPI1_REJECT_ADDR_V)<<(APB_CTRL_G1SPI1_REJECT_ADDR_S))
#define APB_CTRL_G1SPI1_REJECT_ADDR_V  0xFFFFFFFF
#define APB_CTRL_G1SPI1_REJECT_ADDR_S  0

#define APB_CTRL_SDIO_CTRL_REG          (DR_REG_APB_CTRL_BASE + 0x12C)
/* APB_CTRL_SDIO_WIN_ACCESS_EN : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: */
#define APB_CTRL_SDIO_WIN_ACCESS_EN  (BIT(0))
#define APB_CTRL_SDIO_WIN_ACCESS_EN_M  (BIT(0))
#define APB_CTRL_SDIO_WIN_ACCESS_EN_V  0x1
#define APB_CTRL_SDIO_WIN_ACCESS_EN_S  0

#define APB_CTRL_DATE_REG          (DR_REG_APB_CTRL_BASE + 0x3FC)
/* APB_CTRL_DATE : R/W ;bitpos:[31:0] ;default: 32'h18053100 ; */
/*description: */
#define APB_CTRL_DATE  0xFFFFFFFF
#define APB_CTRL_DATE_M  ((APB_CTRL_DATE_V)<<(APB_CTRL_DATE_S))
#define APB_CTRL_DATE_V  0xFFFFFFFF
#define APB_CTRL_DATE_S  0

#ifdef __cplusplus
}
#endif



#endif /*_SOC_APB_CTRL_REG_H_ */


